export const regExps = {
  /**
   * 验证电子邮箱格式
   */
  email: new RegExp(/^\w+((-\w+)|(\.\w+))*\@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/),

  /**
   * 验证手机格式
   */
  mobile: new RegExp(/^1[3-9]\d{9}$/),

  /**
   * 验证URL格式
   */
  url: new RegExp(/http(s)?:\/\/([\w-]+\.)+[\w-]+(\/[\w-.\/?%&=]*)?/),

  /**
   * 验证ISO类型的日期格式
   */
  dateISO: new RegExp(/^\d{4}[\/\-](0?[1-9]|1[012])[\/\-](0?[1-9]|[12][0-9]|3[01])$/),

  /**
   * 验证十进制数字
   */
  number: new RegExp(/^(?:-?\d+|-?\d{1,3}(?:,\d{3})+)?(?:\.\d+)?$/),

  /**
   * 验证整数
   */
  digits: new RegExp(/^\d+$/),

  /**
   * 验证身份证号码
   */
  idCard: new RegExp(/^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/),

  /**
   * 是否车牌号
   */
  carNo: new RegExp(/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1}$/),

  /**
   * 是否新能源车牌号
   */
  carNoXNY: new RegExp(/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}(([0-9]{5}[DF]$)|([DF][A-HJ-NP-Z0-9][0-9]{4}$))/),

  /**
   * 是否为2位小数的金额
   */
  amount: new RegExp(/^[1-9]\d*(,\d{3})*(\.\d{1,2})?$|^0\.\d{1,2}$/),

  /**
   * 是否为中文汉字
   */
  chinese: new RegExp(/^[\u4e00-\u9fa5]+$/),

  /**
   * 是否为字母
   */
  letter: new RegExp(/^[a-zA-Z]*$/),

  /**
   * 是否为字母或者数字
   */
  enOrNum: new RegExp(/^[0-9a-zA-Z]*$/),

  /**
   * 是否为固定电话
   */
  landline: new RegExp(/^\d{3,4}-\d{7,8}(-\d{3,4})?$/)
}
